
## Plan Result (wanda_virtual_machines)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.wanda_k8s_virtual_machines[&#34;wanda-wanda-master0&#34;].proxmox_virtual_environment_vm.vm
  * module.wanda_k8s_virtual_machines[&#34;wanda-wanda-node0&#34;].proxmox_virtual_environment_vm.vm
  * module.wanda_k8s_virtual_machines[&#34;wanda-wanda-node1&#34;].proxmox_virtual_environment_vm.vm
  * module.wanda_k8s_virtual_machines[&#34;wanda-wanda-node2&#34;].proxmox_virtual_environment_vm.vm
  * module.wanda_k8s_virtual_machines[&#34;wanda-wanda-node3&#34;].proxmox_virtual_environment_vm.vm
* Replace
  * proxmox_virtual_environment_download_file.wanda_images[&#34;jammy-server-cloudimg-amd64.img&#34;]
  * terraform_data.k8s_ansible[&#34;wanda&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_virtual_environment_download_file.wanda_images["jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "wanda_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # terraform_data.k8s_ansible["wanda"] must be replaced
-/+ resource "terraform_data" "k8s_ansible" {
      ~ id               = "32895613-dea2-9789-ba31-5cb44b94addb" -> (known after apply)
      ~ triggers_replace = [
            "08_05_2025_0721",
          ~ {
              ~ wanda-wanda-master0 = {
                  ~ primary_mac_address = "BC:24:11:28:70:86" -> (known after apply)
                }
              ~ wanda-wanda-node0   = {
                  ~ primary_mac_address = "BC:24:11:D3:D1:71" -> (known after apply)
                }
              ~ wanda-wanda-node1   = {
                  ~ primary_mac_address = "BC:24:11:3F:FC:30" -> (known after apply)
                }
              ~ wanda-wanda-node2   = {
                  ~ primary_mac_address = "BC:24:11:AC:3F:AE" -> (known after apply)
                }
              ~ wanda-wanda-node3   = {
                  ~ primary_mac_address = "BC:24:11:69:10:C9" -> (known after apply)
                }
            },
            {},
          ~ <<-EOT
                - name: Prepare and install K3S
                  vars:
                    passed_hosts: wanda_k3s_cluster
                    k3s_version: "v1.32.4+k3s1"
                    run_prep: true
                    run_install: false
                  hosts: "{{ passed_hosts }}"
                  become: true
                  become_user: root
                  become_method: sudo
                  pre_tasks:
              -     - name: Set master nodes to be a control node
              -       ansible.builtin.set_fact:
              -         k3s_control_node: true
              -       when: "'master' in inventory_hostname"
              -     - name: Add node-ip to k3s_server conf
              -       ansible.builtin.set_fact:
              -         k3s_server: "{{ k3s_server | combine({ 'node-ip': ansible_host}) }}"
              +   - name: Set cluster_name
              +     ansible.builtin.set_fact:
              +       cluster_name: "{{ inventory_hostname.split('_')[0] }}"
              +   - name: Set master nodes to be a control node
              +     ansible.builtin.set_fact:
              +       k3s_control_node: true
              +     when: "'master' in inventory_hostname"
              +   - name: Add node-ip to k3s_server conf
              +     ansible.builtin.set_fact:
              +       k3s_server: "{{ k3s_server | combine({ 'node-ip': ansible_host}) }}"
                  tasks:
              -     - name: K3S Prepare
              -       when: run_prep
              -       ansible.builtin.include_role:
              -         name: prep
              -     - name: Install K3S
              -       when: run_install
              -       ansible.builtin.include_role:
              -         name: xanmanning.k3s
              -         public: true
              -       vars:
              -         k3s_release_version: "{{ k3s_version }}"
              -         k3s_install_hard_links: true
              -         k3s_become: true
              -         k3s_server_manifests_templates:
              -           - coredns-custom.yaml
              -     - name: Resource Readiness Check
              -       run_once: true
              -       kubernetes.core.k8s_info:
              -         kubeconfig: /etc/rancher/k3s/k3s.yaml
              -         kind: "{{ item.kind }}"
              -         name: "{{ item.name }}"
              -         namespace: "{{ item.namespace | default('') }}"
              -         wait: true
              -         wait_sleep: 10
              -         wait_timeout: 360
              -       loop:
              -         - kind: ConfigMap
              -           name: coredns-custom
              -           namespace: kube-system
              -       register: resource_check
              -       when:
              -         - k3s_server_manifests_templates | length > 0
              -             or k3s_server_manifests_urls | length > 0
              -         - k3s_control_node is defined
              -         - k3s_control_node
              -     - name: Remove deployed manifest templates
              -       ansible.builtin.file:
              -         path: "{{ k3s_server_manifests_dir }}/{{ item | basename |
              -           regex_replace('\\.j2$', '') }}"
              -         state: absent
              -       loop: "{{ k3s_server_manifests_templates | default([]) }}"
              -     - name: Remove deployed manifest urls
              -       ansible.builtin.file:
              -         path: "{{ k3s_server_manifests_dir }}/{{ item.filename }}"
              -         state: absent
              -       loop: "{{ k3s_server_manifests_urls | default([]) }}"
              +   - name: K3S Prepare
              +     when: run_prep
              +     ansible.builtin.include_role:
              +       name: prep
              +   - name: Install K3S
              +     when: run_install
              +     ansible.builtin.include_role:
              +       name: xanmanning.k3s
              +       public: true
              +     vars:
              +       k3s_release_version: "{{ k3s_version }}"
              +       k3s_install_hard_links: true
              +       k3s_become: true
              +       k3s_server_manifests_templates:
              +       - coredns-custom.yaml
              +   - name: Resource Readiness Check
              +     run_once: true
              +     kubernetes.core.k8s_info:
              +       kubeconfig: /etc/rancher/k3s/k3s.yaml
              +       kind: "{{ item.kind }}"
              +       name: "{{ item.name }}"
              +       namespace: "{{ item.namespace | default('') }}"
              +       wait: true
              +       wait_sleep: 10
              +       wait_timeout: 360
              +     loop:
              +     - kind: ConfigMap
              +       name: coredns-custom
              +       namespace: kube-system
              +     register: resource_check
              +     when:
              +     - run_install
              +     - k3s_server_manifests_templates | length > 0 or k3s_server_manifests_urls | length > 0
              +     - k3s_control_node is defined
              +     - k3s_control_node
              +   - name: Remove deployed manifest templates
              +     ansible.builtin.file:
              +       path: "{{ k3s_server_manifests_dir }}/{{ item | basename | regex_replace('\\.j2$', '') }}"
              +       state: absent
              +     loop: "{{ k3s_server_manifests_templates | default([]) }}"
              +     when: run_install
              +   - name: Remove deployed manifest urls
              +     ansible.builtin.file:
              +       path: "{{ k3s_server_manifests_dir }}/{{ item.filename }}"
              +       state: absent
              +     loop: "{{ k3s_server_manifests_urls | default([]) }}"
              +     when: run_install
              +   - name: Check if Cilium is installed
              +     run_once: true
              +     kubernetes.core.k8s_info:
              +       kubeconfig: /etc/rancher/k3s/k3s.yaml
              +       kind: Deployment
              +       name: cilium-operator
              +       namespace: kube-system
              +     register: cilium_check
              +     when: run_install
              +   - name: Set k8s_service_host
              +     run_once: true
              +     ansible.builtin.set_fact:
              +       k8s_service_host: "{{ k3s_server['tls-san'] }}"
              +     when: k3s_server['tls-san'] is defined
              +     delegate_to: localhost
              +   - name: Set single_control_plane_name
              +     run_once: true
              +     ansible.builtin.set_fact:
              +       single_control_plane_name: "{{ hostvars.keys() | select('search', 'master') | select('search', cluster_name) | first }}"
              +     when: k3s_server['tls-san'] is not defined
              +     delegate_to: localhost
              +   - name: Set k8s_service_host
              +     run_once: true
              +     ansible.builtin.set_fact:
              +       k8s_service_host: "{{ hostvars[single_control_plane_name]['ansible_host'] }}"
              +     when: k3s_server['tls-san'] is not defined
              +     delegate_to: localhost
              +   - name: Fetch kubeconfig
              +     when: "'master' in inventory_hostname"
              +     run_once: true
              +     ansible.builtin.fetch:
              +       src: /etc/rancher/k3s/k3s.yaml
              +       dest: ./k3s-kubeconfig.yaml
              +       flat: yes
              +   - name: Update kubeconfig with server address
              +     delegate_to: localhost
              +     run_once: true
              +     become: false
              +     ansible.builtin.lineinfile:
              +       path: ./k3s-kubeconfig.yaml
              +       regexp: "server: https://127.0.0.1:6443"
              +       line: "    server: https://{{ k8s_service_host }}:6443"
              +   - name: Add cilium chart repo
              +     run_once: true
              +     become: false
              +     kubernetes.core.helm_repository:
              +       name: cilium
              +       repo_url: https://helm.cilium.io
              +       force_update: true
              +     delegate_to: localhost
              +     when:
              +     - cilium_check.resources | length == 0
              +     - run_install
              +   - name: Install Cilium
              +     run_once: true
              +     become: false
              +     kubernetes.core.helm:
              +       release_name: cilium
              +       chart_ref: cilium/cilium
              +       chart_version: 1.17.3
              +       namespace: kube-system
              +       create_namespace: false
              +       kubeconfig: ./k3s-kubeconfig.yaml
              +       context: default
              +       values:
              +         kubeProxyReplacement: true
              +         k8sServiceHost: "{{ k8s_service_host }}"
              +         k8sServicePort: 6443
              +         hubble:
              +           enabled: true
              +           relay:
              +             enabled: true
              +           ui:
              +             enabled: true
              +         bgpControlPlane:
              +           enabled: true
              +         ipam:
              +           operator:
              +             clusterPoolIPv4PodCIDRList: [ "{{ k3s_server['cluster-cidr'] }}" ]
              +             clusterPoolIPv4MaskSize: 23
              +     delegate_to: localhost
              +     when:
              +     - cilium_check.resources | length == 0
              +     - run_install
            EOT,
        ]
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-master0"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s control plane"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wanda-master0"
      + network_interface_names = (known after apply)
      + node_name               = "wanda"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-control-plane",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 200

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = "local:snippets/wanda-master0-cloud-config.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.15.8/24"
                  + gateway = "10.151.15.1"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 15
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 10
          + up_delay   = 0
        }

      + vga (known after apply)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node0"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s worker node"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wanda-node0"
      + network_interface_names = (known after apply)
      + node_name               = "wanda"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-worker",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 220

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = "local:snippets/wanda-node0-cloud-config.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.15.16/24"
                  + gateway = "10.151.15.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 15
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 15
          + up_delay   = 0
        }

      + vga (known after apply)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node1"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s worker node"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wanda-node1"
      + network_interface_names = (known after apply)
      + node_name               = "wanda"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-worker",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 221

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = "local:snippets/wanda-node1-cloud-config.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.15.17/24"
                  + gateway = "10.151.15.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 15
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 15
          + up_delay   = 0
        }

      + vga (known after apply)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node2"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s worker node"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wanda-node2"
      + network_interface_names = (known after apply)
      + node_name               = "wanda"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-worker",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 222

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = "local:snippets/wanda-node2-cloud-config.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.15.18/24"
                  + gateway = "10.151.15.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 15
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 15
          + up_delay   = 0
        }

      + vga (known after apply)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node3"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "k8s worker node"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wanda-node3"
      + network_interface_names = (known after apply)
      + node_name               = "wanda"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "k8s-worker",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 223

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = "local:snippets/wanda-node3-cloud-config.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.15.19/24"
                  + gateway = "10.151.15.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 15
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 15
          + up_delay   = 0
        }

      + vga (known after apply)
    }

Plan: 7 to add, 0 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.wanda_k8s_virtual_machines["wanda-wanda-master0"].proxmox_virtual_environment_vm.vm has been deleted
  - resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "200"
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:28:70:86",
        ] -> null
        name                    = "wanda-master0"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node0"].proxmox_virtual_environment_vm.vm has been deleted
  - resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "220"
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:D3:D1:71",
        ] -> null
        name                    = "wanda-node0"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node1"].proxmox_virtual_environment_vm.vm has been deleted
  - resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "221"
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:3F:FC:30",
        ] -> null
        name                    = "wanda-node1"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node2"].proxmox_virtual_environment_vm.vm has been deleted
  - resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "222"
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:AC:3F:AE",
        ] -> null
        name                    = "wanda-node2"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.wanda_k8s_virtual_machines["wanda-wanda-node3"].proxmox_virtual_environment_vm.vm has been deleted
  - resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "223"
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:69:10:C9",
        ] -> null
        name                    = "wanda-node3"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":565,"Program":"tfcmt","SHA1":"","Target":"wanda_virtual_machines","Vars":{}} -->